public/man/man1/flatpak-ps.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-ps.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-ps.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-ps - Enumerate running instances</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak ps</strong> [OPTION…]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Lists useful information about running Flatpak instances.</p>
<p>
To see full details of a running instance, you can open the file
<em>run/user/$UID</em>.flatpak/$INSTANCE/info, where /$INSTANCE/ is the
instance ID reported by flatpak ps.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
<p>
<strong>–columns=FIELD,…</strong></p>
<blockquote>
<p>Specify what information to show about each instance. You can list
multiple fields, or use this option multiple times.</p>
<p>
Append :s[tart], :m[iddle], :e[nd] or :f[ull] to column names to change
ellipsization.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
FIELDS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The following fields are understood by the <strong>–columns</strong> option:</p>
<p>
instance</p>
<blockquote>
<p>Show the instance ID</p>
</blockquote>
<p>
application</p>
<blockquote>
<p>Show the application ID</p>
</blockquote>
<p>
arch</p>
<blockquote>
<p>Show the architecture</p>
</blockquote>
<p>
branch</p>
<blockquote>
<p>Show the application branch</p>
</blockquote>
<p>
commit</p>
<blockquote>
<p>Show the application commit</p>
</blockquote>
<p>
runtime</p>
<blockquote>
<p>Show the runtime ID</p>
</blockquote>
<p>
runtime-branch</p>
<blockquote>
<p>Show the runtime branch</p>
</blockquote>
<p>
runtime-commit</p>
<blockquote>
<p>Show the runtime commit</p>
</blockquote>
<p>
pid</p>
<blockquote>
<p>Show the PID of the wrapper process</p>
</blockquote>
<p>
child-pid</p>
<blockquote>
<p>Show the PID of the sandbox process</p>
</blockquote>
<p>
active</p>
<blockquote>
<p>Show whether the app is active (i.e. has an active window)</p>
</blockquote>
<p>
background</p>
<blockquote>
<p>Show whether the app is in the background (with no open windows)</p>
</blockquote>
<p>
all</p>
<blockquote>
<p>Show all columns</p>
</blockquote>
<p>
help</p>
<blockquote>
<p>Show the list of available columns</p>
</blockquote>
<p>
Note that field names can be abbreviated to a unique prefix.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
EXAMPLES
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p><strong>$ flatpak ps –columns=application,pid,runtime,runtime-branch</strong></p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>*flatpak*(1), *flatpak-run*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
